#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.lambda.aws_lambda_function.sync_runner has changed
  ~ resource "aws_lambda_function" "sync_runner" {
        id                             = "myrunstreak-sync-runner-dev"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-sync-runner-dev:14" -> "arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-sync-runner-dev:15"
        tags                           = {
            "Environment" = "dev"
            "Name"        = "myrunstreak-sync-runner-dev"
            "Project"     = "MyRunStreak"
        }
      ~ version                        = "14" -> "15"
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda_query.aws_lambda_function.sync_runner has changed
  ~ resource "aws_lambda_function" "sync_runner" {
        id                             = "myrunstreak-query-runner-dev"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev:7" -> "arn:aws:lambda:us-east-2:855323747881:function:myrunstreak-query-runner-dev:8"
        tags                           = {
            "Environment" = "dev"
            "Name"        = "myrunstreak-query-runner-dev"
            "Project"     = "MyRunStreak"
        }
      ~ version                        = "7" -> "8"
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_deployment.query_endpoints will be created
  + resource "aws_api_gateway_deployment" "query_endpoints" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "9fmuhcz4y0"
      + triggers      = {
          + "redeployment" = "699d41d858e941b06154b2307c8918d73cc61f01"
        }
    }

  # null_resource.update_stage_deployment will be created
  + resource "null_resource" "update_stage_deployment" {
      + id       = (known after apply)
      + triggers = {
          + "deployment_id" = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @silverbeer, Action: `pull_request`, Working Directory: `terraform/environments/dev`, Workflow: `Terraform Plan`*